app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT * FROM `cars`

  def show
    @car = Car.find(params[:id])
---
SELECT * FROM "cars" WHERE ("cars"."id" = 953125641)

  def edit
    @car = Car.find(params[:id])
---
SELECT * FROM "cars" WHERE ("cars"."id" = 953125641)

  def create
    @car = Car.new(params[:car])

    respond_to do |format|
      if @car.save
---
INSERT INTO `cars` (`name`, `updated_at`, `created_at`) VALUES('Honda', '2009-06-21 02:08:39', '2009-06-21 02:08:39')

  def update
    @car = Car.find(params[:id])
---
SELECT * FROM "cars" WHERE ("cars"."id" = 953125641)

  def destroy
    @car = Car.find(params[:id])
    @car.destroy
---
SELECT * FROM "cars" WHERE ("cars"."id" = 953125641)
DELETE FROM "cars" WHERE "id" = 953125641

  def owners
    @car = Car.find(params[:id])
---
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)