app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM `users`

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`updated_at`, `first_name`, `last_name`, `age`, `hometown`, `created_at`) VALUES('2009-06-20 16:30:15', 'Steve', 'Renaker', 40, 'San Francisco', '2009-06-20 16:30:15')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641)

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641)
DELETE FROM "users" WHERE "id" = 953125641

  def cars
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def car_add
    @user = User.find(params[:id])
    @car = Car.find(params[:car])

    unless @user.has_car?(@car)
      @user.cars << @car
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `cars` WHERE (`cars`.`id` = 3)
INSERT INTO `cars_users` (`car_id`, `user_id`) VALUES (3, 1)

  def car_remove

    @user = User.find(params[:id])

    # get list of cars to remove from query string
    car_ids = params[:cars]

    unless car_ids.blank?
      car_ids.each do |car_id|
        car = Car.find(car_id)
        if @user.has_car?(car)
          logger.info "Removing user from list of car owners for car #{car.id}"
          @user.cars.delete(car)
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `cars` WHERE (`cars`.`id` = 6)
DELETE FROM `cars_users` WHERE user_id = 2 AND car_id IN (6)