app/controllers/visits_controller.rb

SELECT * FROM `visits` WHERE (`visits`.`id` = 1 AND (`visits`.user_id = 1))
---
  def show
    @visit = @user.visits.find(params[:id])

SELECT * FROM `visits` WHERE (`visits`.`id` = 1 AND (`visits`.user_id = 1))
---
  def edit
    @visit = @user.visits.find(params[:id])

INSERT INTO `visits` (`updated_at`, `visit_date`, `place_name`, `user_id`, `created_at`) VALUES('2009-06-20 16:35:16', '2007-03-05', 'New York City', 1, '2009-06-20 16:35:16')
---
  def create
    @visit = @user.visits.build(params[:visit])

    respond_to do |format|
      if @visit.save

SELECT * FROM `visits` WHERE (`visits`.`id` = 1 AND (`visits`.user_id = 1))
UPDATE `visits` SET `visit_date` = '2007-10-05', `updated_at` = '2009-06-20 17:50:42' WHERE `id` = 1
---
  def update
    @visit = @user.visits.find(params[:id])

    respond_to do |format|
      if @visit.update_attributes(params[:visit])

SELECT * FROM `visits` WHERE (`visits`.`id` = 8 AND (`visits`.user_id = 1))
DELETE FROM `visits` WHERE `id` = 8
---
  def destroy
    @visit = @user.visits.find(params[:id])
    @visit.destroy